from indic_text_norm.normalization.normalizer import Normalizer


as_ = "১ম জন্মদিন। মোৰ হাতত $8000 আছে। 1লি ৰ বাবে শাৰী পাতি আমৰ ৰস কিনিলোঁ। মোৰ ঠাই 1500 বৰ্গমিটাৰ।"
bn = "১ম জন্মদিন। আমার কাছে ₺40000 আছে। আমি 1লি জন্য লাইনে দাঁড়িয়ে আমের জুস কিনলাম। আমার 1500 বর্গ.মিটার জায়গা আছে।"
brx = "हेलो डा. राहुल। आंनि फिसाज्लानि सेथि जोनोम सान। आंनाव $4000 दं।में 1/2लि आम दा रस खरीदेआ ऐ।। आंहा 1500 बर्गमि हा दं, दिनैनि अक्ट 'आ 21 एबा 20 नंगौना?"
dgr = "नमस्कार डा राहुल जी। मेरे पुत्तर दा १ला जन्मदिन। मेरे कोल $4000 ऐ। मैं लाइन च खड़ोई गेआ ते 1/2 ली आम दा रस खरीदी लेआ। मेरे कोल 1500 वर्ग.मी दी जमीन ऐ, अज्ज दी तारीख 21 या 20 हं?"
en = "Hello Dr. Rahul. My son's 1st birthday. I have $4000. I stood in line and bought 1/2 l mango juice. I have 1500 sq.m land, today's date is 21 or 20 huh?"
gu = "૧લું જન્મદિવસ. મારી પાસે $4000 છે. હું 1 લી માટે લાઇનમાં ઉભો રહ્યો અને કેરીનો રસ ખરીદ્યો. મારી પાસે 1500 સ્ક્વે.મી જગ્યા છે."
hi = "मेरे पास $4000 हैं. मैं लाइन में खड़ा हुआ और 1 ली आम का जूस खरीदा। मेरे पास 1500 वर्ग.मी की जगह है।"
kn = "೧ನೇ ಹುಟ್ಟುಹಬ್ಬ. ನನ್ನ ಬಳಿ $4000 ಇದೆ. ನಾನು 1ಲೀ ಗೆ ಸಾಲಿನಲ್ಲಿ ನಿಂತು ಮಾವಿನ ರಸವನ್ನು ಖರೀದಿಸಿದೆ. ನನ್ನ ಬಳಿ 1500ಚಮೀ "
knk = "नमस्कार डॉ. राहुल. म्हज्या पुताचो पयलो वाडदीस. म्हजे कडेन $4000 आसात. हांव रांगेंत उबो रावलो आनी 3/4 लि आंब्याचो रोस विकत घेतलो. म्हजे कडेन 1500 चौसें.मी जमीन आसा, आयची तारीख 21 वा 20 हें?"
ks = "مے چھ۔ $4000 ایڈ  12.100 جی اٮ۪م  فیوی سٹِک  سُپر گلوٗ سٹِک  10 س گ پاکٮ۪ٹ  چِنٛگس  سیٖکرِٹ وٮ۪ج ہاکا نوٗڈٕلز ، .10 مربع  میٹر"
mr = "5वा वाढदिवस. माझ्याकडे $4000 आहेत. मी 1 मिली साठी रांगेत उभे राहून आंब्याचा रस विकत घेतला. माझ्याकडे 2400 वर्ग.मी जागा आहे."
ml = "1)൦ എനിക്ക് $4000 ഉണ്ട്. 1 ലി ക്യൂ നിന്നു മാമ്പഴ ജ്യൂസ് വാങ്ങി. എനിക്ക് 1500 ച.മീ മീറ്റർ സ്ഥലമുണ്ട്."
mn = "ꯍꯦꯂꯣ Dr. ꯔꯥꯍꯨꯜ ꯫. ꯑꯩꯒꯤ ꯃꯆꯥꯅꯨꯄꯥꯒꯤ ꯱ꯁꯨꯕꯥ ꯑꯍꯥꯟꯕ ꯕꯔꯊꯗꯦ ꯫ꯑꯩꯒꯤ ¥4000 ꯑꯃꯁꯨꯡ ꯁ ꯭ ꯀ ꯭ ꯋꯥꯔ ꯃꯤꯇꯔ 1500ꯁ꯭ꯛꯕ꯭ꯌꯥꯔꯃꯤ ꯑꯃ ꯂꯩ ꯫"
sa = "नमस्कारं डा. राहुलः। मम पुत्रस्य प्रथमः जन्मदिवसः अस्ति। मम $4000 अस्ति। अहं पङ्क्तौ स्थित्वा 1/2 ली. आम्बरसम् अक्रीणामि। मम 1500 वर्गमी भूमिः अस्ति, अद्यतनं दिनाङ्कः 21 वा 20 वा अस्ति किम्?"
ta = "வணக்கம் Dr. ராகுல். என் மகனின் 1 வது பிறந்த நாள். என்னிடம் $4000 உள்ளது. நான் வரிசையில் நின்று 1/2 லி மாம்பழச்சாறு வாங்கினேன். என்னிடம் 1500சதுர.மீ இடம் உள்ளது, இன்றைக்கு தேதி 21 இல்லை 20 ஆ?"
te =  "నా కొడుకు 3వ పుట్టినరోజు. నా దగ్గర $4000 ఉంది. నేను 3 లీ మామిడికాయ రసం కొన్నాను. నాకు 1500 చ.మీ స్థలం ఉంది. "
np = "नमस्ते प्रा. राहुल। मेरो छोराको पहिलो जन्मदिन। मसँग $4000 छ। म लाइनमा उभिएर 3/4 ली आँपको जुस किनें। मसँग 1500 वर्गमी जमिन छ, आजको"
or_ = "ନମସ୍କାର ଡ. ରାହୁଲ।. ମୋ ପୁଅର ୧ମ ଜନ୍ମଦିନ। ମୋର $4000 ଅଛି | ମୁଁ ଲାଇନରେ ଛିଡା ହୋଇ 400 ମିଲି ଆମ୍ବ ରସ କିଣିଲି | ମୋର 1500 ବମି ଜମି ଅଛି, ଆଜିର ତାରିଖ 21 କିମ୍ବା 20 ହୁ?"
sat = "ᱦᱚᱞᱳ ᱥᱟᱪᱮᱫ ᱨᱟᱡᱩᱞ ᱾ ᱤᱧᱨᱮᱱ ᱠᱚᱲᱟ ᱠᱚᱲᱟ ᱨᱮᱱ ᱑ᱞᱳ ᱡᱟᱱᱟᱢ ᱢᱟᱦᱟ ᱾ᱤᱧ ᱴᱷᱮᱱ $4000 ᱟᱨ 1500 ᱵᱚᱨ.ᱢᱤ ᱡᱩᱢᱤ ᱢᱮᱱᱟᱜᱼᱟ ᱾ "
sin = "हैलो प्रो राहुल। मूं जे पुट जो 1st जनम दिन आहे। मूं वटि  €400 आहिनि। मां लाइनु में ठहियो ऐं 750 मिली आम जो रस ख़रीदु कयो। मूं वटि 1500 वर्ग.मी ज़मीन आहे, अज॒ जी तारीख़ 21 या 20 आहे हा?"
ur = "مے چھ۔ ڈالر ایڈ  ۱/۲ گرام اٮ۪م  فیوی سٹِک  سُپر گلوٗ سٹِک  10 مگ  چِنٛگس  سیٖکرِٹ وٮ۪ج ہاکا نوٗڈٕلز, میں نے 8093.71 مربع میٹر کی زمین خریدی جس کی قیمت $6320 ہے" 

#एक
orig_ta = "வணக்கம் டாக்டர் ராகுல். என் மகனின் ஒன்றாவது பிறந்த நாள். என்னிடம்  நான்காயிரம்‌ டாலர் உள்ளது. நான் வரிசையில் நின்று அரை லிட்டர் மாம்பழச்சாறு வாங்கினேன். என்னிடம் ஆயிரத்து ஐநூறு சதுர மீட்டர் இடம் உள்ளது, இன்றைக்கு தேதி இருபத்து ஒன்று இல்லை இருபது ஆ?"
orig_hi = "मेरे पास  चार हज़ार डॉलर हैं. मैं लाइन में खड़ा हुआ और एक लीटर आम का जूस खरीदा। मेरे पास एक हज़ार पाँच सौ वर्ग मीटर की जगह है।"
orig_mr = " पाचवा वाढदिवस. माझ्याकडे  चार हज़ार डॉलर आहेत. मी एक मिलीलीटर साठी रांगेत उभे राहून आंब्याचा रस विकत घेतला. माझ्याकडे दोन हज़ार चारशे वर्ग मीटर जागा आहे."
orig_te = "నా కొడుకు మూడవ  పుట్టినరోజు. నా దగ్గర  నాలుగు వేలు డాలరు ఉంది. నేను మూడు లీటర్లు మామిడికాయ రసం కొన్నాను. నాకు ఒక వెయ్యి ఐదు వందలు చదరపు మీటర్లు స్థలం ఉంది. "
orig_ml = " ഒന്നാം  എനിക്ക്  നാലായിരം ഡോളര്‍ ഉണ്ട്. ഒന്ന് ലിറ്റര്‍ ക്യൂ നിന്നു മാമ്പഴ ജ്യൂസ് വാങ്ങി. എനിക്ക് ആയിരത്തി അഞ്ഞൂറ് ചതുരശ്ര മീറ്റര്‍ മീറ്റർ സ്ഥലമുണ്ട്."
orig_as = " প্রথম জন্মদিন। মোৰ হাতত  আঠ হাজাৰ ডলাৰ আছে। এক লিটাৰ ৰ বাবে শাৰী পাতি আমৰ ৰস কিনিলোঁ। মোৰ ঠাই এক হাজাৰ পাঁচশ বৰ্গমিটাৰ।"
orig_bn = " প্রথম জন্মদিন। আমার কাছে  চল্লিশ হাজার লিরা আছে। আমি এক লিটার জন্য লাইনে দাঁড়িয়ে আমের জুস কিনলাম। আমার এক হাজার পাঁচশো বর্গ.মিটার জায়গা আছে।"
orig_gu = " પહેલું જન્મદિવસ. મારી પાસે  ચાર હજાર ડોલર છે. હું એક લીટર્સ માટે લાઇનમાં ઉભો રહ્યો અને કેરીનો રસ ખરીદ્યો. મારી પાસે એક હજાર પાંચ સો સ્ક્વેર મીટર્સ જગ્યા છે."
orig_kn = " ಪ್ರಥಮ ಹುಟ್ಟುಹಬ್ಬ. ನನ್ನ ಬಳಿ  ನಾಲ್ಕು ಸಾವಿರದ ಡಾಲರ್ ಇದೆ. ನಾನು ಒಂದು ಲೀಟರ್ ಗೆ ಸಾಲಿನಲ್ಲಿ ನಿಂತು ಮಾವಿನ ರಸವನ್ನು ಖರೀದಿಸಿದೆ. ನನ್ನ ಬಳಿ ಒಂದು ಸಾವಿರದ ಐನೂರು ಚದರ ಮೀಟರ್ "
orig_en = "Hello Doctor Rahul. My son's First birthday. I have  four thousand Dollar. I stood in line and bought one half liter mango juice. I have one thousand five hundred Square meters land, today's date is twenty one or twenty huh?"
orig_dgr = "नमस्कार डॉक्टर राहुल जी। मेरे पुत्तर दा १ला जन्मदिन। मेरे कोल  4000 डॉलर ऐ। मैं लाइन च खड़ोई गेआ ते अद्धा लीटर आम दा रस खरीदी लेआ। मेरे कोल 1500 वर्ग मीटर दी जमीन ऐ, अज्ज दी तारीख 21 या 20 हं?"
orig_brx = "हेलो डाक्टार राहुल। आंनि फिसाज्लानि सेथि जोनोम सान। आंनाव  4000 डलार दं।में खावसे लिटार  आम दा रस खरीदेआ ऐ।। आंहा 1500 बर्ग मिटार  हा दं, दिनैनि अक्ट 'आ 21 एबा 20 नंगौना?"
orig_sa = "नमस्कारं वैद्यः राहुलः। मम पुत्रस्य प्रथमः जन्मदिवसः अस्ति। मम  4000 डालर् अस्ति। अहं पङ्क्तौ स्थित्वा अर्धम् लीटर्स् आम्बरसम् अक्रीणामि। मम 1500 वर्गमी भूमिः अस्ति, अद्यतनं दिनाङ्कः 21 वा 20 वा अस्ति किम्?"
orig_knk = "नमस्कार दोतोर राहुल. म्हज्या पुताचो पयलो वाडदीस. म्हजे कडेन  4000 डॉलर आसात. हांव रांगेंत उबो रावलो आनी तीन चतुर्थांश लिटर आंब्याचो रोस विकत घेतलो. म्हजे कडेन 1500 चौखण सेंटिमिटर जमीन आसा, आयची तारीख 21 वा 20 हें?"
orig_ks = "مے چھ۔  4000 ڈالر ایڈ  12.100 گرام اٮ۪م  فیوی سٹِک  سُپر گلوٗ سٹِک  10  سینٹی گرام  پاکٮ۪ٹ  چِنٛگس  سیٖکرِٹ وٮ۪ج ہاکا نوٗڈٕلز ، .10 مربع  میٹر"
orig_mn = "ꯍꯦꯂꯣ ꯗꯛꯇꯔ ꯔꯥꯍꯨꯜ ꯫. ꯑꯩꯒꯤ ꯃꯆꯥꯅꯨꯄꯥꯒꯤ  ꯑꯍꯟꯕ ꯑꯍꯥꯟꯕ ꯕꯔꯊꯗꯦ ꯫ꯑꯩꯒꯤ  4000 ꯌꯨꯑꯥꯟ ꯑꯃꯁꯨꯡ ꯁ ꯭ ꯀ ꯭ ꯋꯥꯔ ꯃꯤꯇꯔ 1500 ꯁꯀꯨꯨꯋꯦꯔ ꯃꯤꯇꯔꯁꯤꯡ ꯑꯃ ꯂꯩ ꯫"
orig_np = "नमस्ते प्राचार्य राहुल। मेरो छोराको पहिलो जन्मदिन। मसँग  4000 डलर छ। म लाइनमा उभिएर तिन चौथाई लिटर आँपको जुस किनें। मसँग 1500 वर्ग मीटर जमिन छ, आजको"
orig_or = "ନମସ୍କାର ଡକ୍ଟର ରାହୁଲ।. ମୋ ପୁଅର ପ୍ରଥମ ଜନ୍ମଦିନ। ମୋର  ଚାରି ହଜାର ଡଲାର ଅଛି | ମୁଁ ଲାଇନରେ ଛିଡା ହୋଇ ଚାରି ଶହ ମିଲିଲିଟର ଆମ୍ବ ରସ କିଣିଲି | ମୋର ଏକ ହଜାର ପାଞ୍ଚ ଶହ ବର୍ଗ ମିଟର ଜମି ଅଛି, ଆଜିର ତାରିଖ ଏକୋଇଶ କିମ୍ବା କୋଡିଏ ହୁ?"
orig_sin = "हैलो प्राध्यापक राहुल। मूं जे पुट जो पहिरियों जनम दिन आहे। मूं वटि   400 यूरो आहिनि। मां लाइनु में ठहियो ऐं 750 मिलीलीटर आम जो रस ख़रीदु कयो। मूं वटि 1500 वर्ग मीटर ज़मीन आहे, अज॒ जी तारीख़ 21 या 20 आहे हा?"
orig_sat = "ᱦᱚᱞᱳ ᱥᱟᱪᱮᱫ ᱨᱟᱡᱩᱞ ᱾ ᱤᱧᱨᱮᱱ ᱠᱚᱲᱟ ᱠᱚᱲᱟ ᱨᱮᱱ ᱯᱩᱭᱞᱳ ᱡᱟᱱᱟᱢ ᱢᱟᱦᱟ ᱾ᱤᱧ ᱴᱷᱮᱱ  4000 ᱰᱚᱞᱟᱨ ᱟᱨ 1500 ᱵᱚᱨᱜᱽ ᱢᱤᱴᱟᱨ ᱡᱩᱢᱤ ᱢᱮᱱᱟᱜᱼᱟ ᱾ "
orig_ur = "مے چھ۔ ڈالر ایڈ  آدھا  گرام اٮ۪م  فیوی سٹِک  سُپر گلوٗ سٹِک  دس ملی گرام   چِنٛگس  سیٖکرِٹ وٮ۪ج ہاکا نوٗڈٕلز, میں نے 8093.71 مربع میٹر کی زمین خریدی جس کی قیمت  چھے ہزار تین سو بیس ڈالر ہے"



normalize = Normalizer()


def test_all():

    assert normalize.normalizer(ta, "ta") == orig_ta
    assert normalize.normalizer(hi, "hi") == orig_hi
    assert normalize.normalizer(mr, "mr") == orig_mr
    assert normalize.normalizer(te, "te") == orig_te
    assert normalize.normalizer(ml, "ml") == orig_ml
    assert normalize.normalizer(as_, "as") == orig_as
    assert normalize.normalizer(bn, "bn") == orig_bn
    assert normalize.normalizer(gu, "gu") == orig_gu
    assert normalize.normalizer(kn, "kn") == orig_kn
    assert normalize.normalizer(en, "en") == orig_en
    assert normalize.normalizer(dgr, "dgr") == orig_dgr
    assert normalize.normalizer(brx, "brx") == orig_brx
    assert normalize.normalizer(ks, 'ks') == orig_ks
    assert normalize.normalizer(mn, 'mn') == orig_mn
    assert  normalize.normalizer(knk, 'knk') == orig_knk
    assert normalize.normalizer(or_, 'or') == orig_or
    assert normalize.normalizer(sa, 'sa') == orig_sa
    assert normalize.normalizer(sat, 'sat') == orig_sat
    assert normalize.normalizer(sin, 'sin') == orig_sin
    assert normalize.normalizer(np, 'np') == orig_np
    assert normalize.normalizer(ur, 'ur') == orig_ur